<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 4: Extra-Credit
</span>
</center></i>

# Introduction and Overview

## Overview

- This extra-credit homework is worth 2.5 points.


- There is one assignment for both the programming and non-programming track.


- By this point in the semester, you should not need all of the helper code that I have previously provided. You can find the code in previous notebooks, homework assignments, examples, etc.


- This homework uses the ```classicmodels``` database, which you have previously loaded.

## Submission Instructions

## Guidelines

__Note:__ TAs to make make any changes.

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [3]:
# Print your name, uni, and track below

name = "Ziggy Chen"
uni = "xc2605"
track = "Non-programmming Track"

print(name)
print(uni)
print(track)

Ziggy Chen
xc2605
Non-programmming Track

In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [7]:
%sql SHOW TABLES FROM classicmodels;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('customer_order_copy',),
 ('customer_order_summary',),
 ('customers',),
 ('employees',),
 ('offices',),
 ('orderdetails',),
 ('orders',),
 ('payments',),
 ('productlines',),
 ('products',)]

In [8]:
%sql USE classicmodels;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [9]:
%sql SELECT * FROM orders JOIN orderdetails USING(ordernumber) LIMIT 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_1749', 30, Decimal('136.00'), 3),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_2248', 50, Decimal('55.09'), 2),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_4409', 22, Decimal('75.46'), 4),
 (10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S24_3969', 49, Decimal('35.29'), 1),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128, 'S18_2325', 25, Decimal('108.06'), 4),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128, 'S18_2795', 26, Decimal('167.06'), 1),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128, 'S24_1937', 45, Decimal('32.53'), 3),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128, 'S24_2022', 46, Decimal('44.35'), 2),
 (10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 18), datetime.date(2003, 1, 14), 'Shipped', None, 181, 'S18_1342', 39, Decimal('95.55'), 2),
 (10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 18), datetime.date(2003, 1, 14), 'Shipped', None, 181, 'S18_1367', 41, Decimal('43.13'), 1)]

# Star Schema

- Create a [Star Schema](https://en.wikipedia.org/wiki/Star_schema) for the ```classicmodels``` database.


- My schema name is ```classicmodels_olap``` and the schema is:

```
create table if not exists classicmodels_olap.date_dimension
(
    orderDate               date not null
        primary key,
    `year(orderDate)`       int  null,
    `quarter(orderDate)`    int  null,
    `month(orderDate)`      int  null,
    `dayofmonth(orderDate)` int  null
);

create table if not exists classicmodels_olap.location_dimension
(
    location_dimension_id int auto_increment
        primary key,
    city                  varchar(50) charset latin1 not null,
    country               varchar(50) charset latin1 not null,
    region                varchar(12)                null
);

create table if not exists classicmodels_olap.product_dimension
(
    productLine          varchar(50) charset latin1 not null,
    productScale         varchar(10) charset latin1 not null,
    productVendor        varchar(50) charset latin1 not null,
    product_dimension_id int auto_increment
        primary key
);

create table if not exists classicmodels_olap.order_facts
(
    location_dimension_id int                        null,
    product_dimension_id  int                        null,
    orderDate             date                       not null,
    customerNumber        int                        not null,
    productCode           varchar(15) charset latin1 not null,
    orderNumber           int                        not null,
    quantityOrdered       int                        not null,
    priceEach             decimal(10, 2)             not null,
    constraint order_facts_date_dimension_null_fk
        foreign key (orderDate) references classicmodels_olap.date_dimension (orderDate),
    constraint order_facts_location_dimension_null_fk
        foreign key (location_dimension_id) references classicmodels_olap.location_dimension (location_dimension_id),
    constraint order_facts_product_dimension_null_fk
        foreign key (product_dimension_id) references classicmodels_olap.product_dimension (product_dimension_id)
);
```

- In the following cells, write and execute SQL to load data from ```classicmodels``` into ```classicmodels_olap.```

- In the following cells, write SQL statements that test and demonstrate that you have correctly loaded the data.


- You must write at least 5 test statements.